# ハッシュの練習
# ハッシュ = {キー => 値}
eto = {"ね" => "子","うし" => "丑","とら" => "寅","う" => "卯","たつ" => "辰","み" => "巳","うま" => "午","ひつじ" => "未","さる" => "申","とり" => "酉","いぬ" => "戌","い" => "亥"}

# ハッシュの呼び出し ハッシュ[キー]
puts ("#{eto["ね"]}")

# 複数の値を取得　.values_at(キー1,キー2)
puts ("#{eto.values_at("ね","うし","とら")}")

# ハッシュの要素の数　.size
puts ("etoの要素の数は#{eto.size}")


days = {"sun" => "日","mon" => "月","tue" => "火","wed" => "水","thu" => "木","fri" => "金"}
puts ("#{days}")

# ハッシュにキーと値を挿入 　ハッシュ[キー] = 値
days["sat"] = "土"
days["holiday"] = "休み"
puts ("#{days}")

# ハッシュのキーと値を削除 　ハッシュ.delete(キー){|key| 存在しないときの処理}
days.delete("holiday"){|key| puts ("#{key}は存在しません")}
days.delete("x-day"){|key| puts ("#{key}は存在しません")}
puts ("#{days}")
