# 配列の練習

a = ['あ','い','う','え','お']
puts ("#{a}の0番目の値は#{a[0]}")


# 値を書き換える場合
b =['a','b','c']
b_1 =['a','b','c']
b_1[2] = 'z'
puts ("#{b}の2番目の値にｚを代入すると#{b_1}")

# 値を挿入する場合(もともとあったものは後ろにずれる)
# 配列.insert(位置,内容１、内容２、内容３...)
c = ['あ','い','う','え','お']
c_1 = ['あ','い','う','え','お']
c_1.insert(2,'か','き','く','け','こ')
puts ("#{c}の2番目の値にかきくけこを代入すると#{c_1}")

# 配列の値を削除
# 配列.delete(削除したい内容)

d = ["あ", "い", "か", "き", "く", "け", "こ", "う", "え", "お"]
d_1 = ["あ", "い", "か", "き", "く", "け", "こ", "う", "え", "お"]
d_1.delete('あ')
puts ("#{d}から「あ」を削除 ＝ #{d_1}")

# 配列.delete_at(削除したい位置)
d_2 = ["あ", "い", "か", "き", "く", "け", "こ", "う", "え", "お"]
d_2.delete_at(2)
puts ("#{d}から2番目の値を削除 ＝ #{d_2}")



# 値を取り出す（もととなる配列から削除）
# 先頭から取り出す　配列.shift(長さ)
e = ["あ", "い", "か", "き", "く", "け", "こ", "う", "え", "お"]
e_1 = ["あ", "い", "か", "き", "く", "け", "こ", "う", "え", "お"]
e_2 = e_1.shift(2)
puts ("#{e}から先頭の2個を抜き出すと#{e_2}、残りは#{e_1}")

# 最後から取り出す　配列.pop(長さ)
f = [ "か", "き", "く", "け", "こ", "う", "え", "お"]
f_1 = ["か", "き", "く", "け", "こ", "う", "え", "お"]
f_2 = f_1.pop(3)
puts ("#{f}から後3個を抜き出すと#{f_2}、残りは#{f_1}")

# 要素の数 .size
puts ("fの要素の数は#{f.size}")
